Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnitEnum
The distributed moment unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnitEnum.KGM_M
Kilogram meter per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnitEnum.TONM_M
Ton meter per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnitEnum.NM_M
Newton meter per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnitEnum.DANM_M
daNewton meter per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnitEnum.KNM_M
kNewton meter per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnitEnum.LBFFT_FT
Lbf feet per feet.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnitEnum.KIPFT_FT
Kip feet per feet.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnitEnum.UNKNOWN
unknown unit.